{
    "name": "Arroz con leche",
    "category": "Desserts",
    "description": "/'Rice with milk'/ ",
    "origin": "3000-250 BC, Asia.",
    "portions": 4,
    "flags": {
        "difficulty": "Easy",
        "cuisine": "Spanish",
        "prepTime": "20'",
        "totalTime": "4h",
        "lactoseFree": false,
        "glutenFree": true,
        "vegetarian": true,
        "vegan": false
    },
    "ingredients": {
        "": [
            "700ml whole milk",
            "50g white rice (no basmati, no flavoured rice of any kind, not the long kind)",
            "35g sugar",
			"Tsp of butter",
			"Tsp or a stick of cinnamon",
			"A couple of citrus fruit peels"
        ]
    },
    "utensils": [
        "Kitchen pot"
    ],
    "instructions": [
		"If you don't have dry fruit skin, you might want to do it at least a day before so it dries and it becomes less bitter. Take extreme care of not getting absolutely any pith (the white stuff) so the peel should be very thin. Otherwise the pudding will contract a bitter taste. They can be left to eat or removed after boiling the milk.",
        "- With the help of a glass (using a strainer wastes water) wash the rice until the water comes off more or less clear.", 
		"- In a pot pour the milk along with the fruit peel and sugar on medium to high heat. When it starts to boil add the rice and lower the heat. It will bubble, sometimes a lot. Stirring with a fork helps, but don't be afraid to take the pot out of the stove if it's about to overflow. It will subside eventually.",
		"- The goal now is to cook on very low heat, to a slight boil, from 1.5 to 2h.",
		"- In a plate mix using a fork the butter and cinnamon to form a paste, then add it to the rice.",
		"Unfortunately, cooking this dish requires frequent attention. Every 15-20 minutes, check on it, stir, break the top layer. Once it's done the milk will have changed color, it will be thicker in consistency, but still have liquid. Turn off heat and cover."
    ],
    "variants": [
        "Use peels from different fruits like apples.",
		"Explore how they make rice pudding in other countries."
    ],
    "tips": {
        "culinary": [],
        "serving": [
			"Serve in small ceramic glasses, with a dash of cinnamon on top to decorate."
		]
    }
}