{
    "name": "Chicken Makhani",
    "category": "Main courses",
    "description": "/'Butter chicken'/",
    "origin": "",
    "portions": 3,
    "flags": {
        "difficulty": "Medium",
        "cuisine": "North Indian",
        "prepTime": "1h 30'",
        "totalTime": "13h",
        "lactoseFree": false,
        "glutenFree": false,
        "vegetarian": false,
        "vegan": false,
		"finished": true
    },
    "ingredients": {
        "First short marinade": [
            "600 g chicken breast cut in thin cubes (should be thighs. I think it's okay to use breast though)",
			"Salt"
        ],
		"Second marinade": [
			"0.5 tsp Kashmiri red chili powder (don't substitute it entirely with paprika, the flavor is completely different)",
			"0.3 tsp salt",
			"1 tbsp lemon juice",
			"80 g greek yogurt",
			"2 tsp ginger garlic paste (substitute with half ginger half garlic)",
			"0.3 tsp turmeric",
			"1 tsp garam masala",
			"0.3 tsp cumin powder",
			"1 tsp coriander powder",
			"12 g olive oil (1 tbsp)"
		],
		"Sauce": [
			"2 tbsp ghee (unholy substitute it with half oil half butter, 24 g)",
			"Cinnamon stick (1)",
			"Green cardamoms (3)",
			"Cloves (3)",
			"8 tomatoes (or 260 g passata. Read culinary tip #2)",
			"2 tsp ginger garlic paste",
			"Green chili (1, deseeded, slit or chopped)",
			"Raw cashews (28 of them. Roasted cashews are also fine.)",
			"1 tsp Kashmiri red chili powder",
			"1 tsp garam masala",
			"0.3 tsp cumin powder",
			"1 tsp coriander powder"
		],
		"Finishing": [
			"90 g heavy cream",
			"0.5 tbsp Kasuri methi (dried fenugreek leaves, crushed)",
			"1 tbsp chopped coriander leaves"
		]
    },
    "utensils": [
		"Kitchen pot",
		"Hand blender",
		"Oven"
	],
    "instructions": [
        "# First short marinade",
		"- Prepare the chicken in medium cubes, removing bones and extra fat.",
		"- Add some salt to it, leave aside.",
		"# Second marinade",
		"- Prepare and mix the spices.",
		"- Spread it on the chicken and leave it covered for at least 8 h.",
		"- Leave the cashews in a bit of boiling water, to soften up.",
		"# Grilling the chicken",
		"You can either do this in a pan or in the oven. I use the oven. After pre-heating, set at 220ºC (convection) for 21'.",
		"# Spice paste",
		"- While it's in the oven, in a (preferably high) pot, cook the tomato passata with the ghee. When it dries it will start caramelizing, which is nice to counteract its own acidity.",
		"- Meanwhile prepare the sauce spice mix and finely blend the cashews. Add the spice when the tomato is dry.",
		"- Keep stirring around. It will be ready when it clumps up together, not sticking to the pot.",
		"# Finishing",
		"- Take the chicken out of the oven and, in the same oven pot, combine everything: the paste, chicken and cashew cream, with about 400 mL of water.",
		"- After simmering for some time, you should be able to see traces of fat on top. Add heavy cream and reduce for 2-3'.",
		"- Turn off the heat and throw in the fine leaves. If you do it while hot they will turn black."
    ],
    "variants": [],
    "tips": {
        "culinary": [
			"Be strict with the oven time and avoid burning the tomato/spices.",
			"Some people add onions. But the whole point of butter chicken is having a silky smooth sauce. Onions will mess with it.",
			"If you are not used to hot spicy food, substitute 2/3rds of the Kashmiri chili powder with sweet paprika."
		],
        "serving": [
			"Served with naan bread, rice..."
		]
    }
}