{
    "name": "Sopa de pollo con fideos",
    "category": "Main courses",
    "description": "/'Chicken noodle soup'/",
    "origin": "1000s, China.",
    "portions": 4,
    "flags": {
        "difficulty": "Easy",
        "cuisine": "Spanish",
        "prepTime": "15'",
        "totalTime": "1h",
        "lactoseFree": true,
        "glutenFree": false,
        "vegetarian": false,
        "vegan": false,
		"finished": true
    },
    "ingredients": {
        "": [
            "Fine noodles",
			"1 onion",
			"2 tomatoes",
			"2 carrots",
			"5 cloves of garlic",
			"Half chicken breast or equivalent",
			"1 tsp sweet paprika",
			"Salt",
			"2 tbsp olive oil"
        ]
    },
    "utensils": [
		"Kitchen pot",
		"Hand blender"
    ],
    "instructions": [
        "- Heat until boiling the chicken, 1.5L water and some salt.",
		"- Add the tomatoes and onions, cut in half, the carrots and the garlic. Don't remove the skin of the tomatoes.",
		"- Once it's boiling, lower to medium heat, add the oil, paprika and count 45 min.",
		"- Cut carrots in slices, chicken in small pieces, throw out the onion pressing it for the juice and peel the tomatoes. Take 1 piece of carrot, the tomatoes, 2 or 3 pieces of garlic and some juice, all into a blender.",
		"- Correct for salt, take to a boil, measure the noodles to cover the low part of a bowl and add them, cooking for whatever the package says.",
		"- When time finishes, add the finely blended juice."
    ],
    "variants": [
		"You can put a sliced quarter of a bell pepper.",
		"Or a few strands of saffron, to give color and a subtle flavor."
	],
    "tips": {
        "culinary": [
			"At least in Spain we tend to use the orange artificial colorant a lot, made from tartrazine (E-102). It's not healthy. In this recipe we replaced it with the piece of carrot and tomatoes blended at the end, plus some optional saffron.",
			"Don't add the blended juice before turning off the heat because the trapped air will make foam, worsening the look."
		],
        "serving": []
    }
}