{
    "name": "Estofado",
    "category": "Main courses",
    "description": "/'Meatballs in sauce'/ ",
    "origin": "300s Rome, Ancient Rome. (De recoquinaria, Apicius)",
    "portions": 3,
    "flags": {
        "difficulty": "Easy",
        "cuisine": "Spanish",
        "prepTime": "1h",
        "totalTime": "2h",
        "lactoseFree": true,
        "glutenFree": false,
        "vegetarian": false,
        "vegan": false,
		"finished": false
    },
    "ingredients": {
        "Meatballs": [
            "250 g minced beef",
			"250 g minced pork",
			"1 egg",
			"2 slices of sandwich bread (without the crust)",
			"Milk",
			"1 garlic clove (minced)",
			"Salt",
			"Pepper",
			"Flour"
        ],
		"The rest": [
			"2 garlic cloves (cut)",
			"2 onions",
			"3 ripe tomatoes (or equivalent)",
			"Quarter glass of white wine",
			"Salt",
			"Sweet paprika",
			"Bay leaf",
			"Thyme",
			"2 tbsp olive oil"
		]
    },
    "utensils": [
		"Kitchen pot",
		"Pan"
	],
    "instructions": [
		"The first two steps can and should be prepared at the same time.",
		"",
        "# Tomatoes",
		"- On a pot, put a tiny bit of oil with the tomatoes cut in half, cover and place on a low-medium heat.",
		"- After some minutes the tomatoes are soft and they are to be mashed with a fork, and left cooking on low.",
		"# Meatballs",
		"- To a beaten egg add pepper, salt, a minced clove of garlic, mix well and add the meat. Shred the bread, slightly soak in milk and mix in with the rest.",
		"- Add the 2 tbsp of oil on a pan and start heating on medium.",
		"- Using the measure of your choice (i.e. a spoon) make evenly sized meatballs, cover in flour (shake the extra flour) and brown them on at least 2 sides.",
		"- When they are done, add them to the tomato sauce, which by now can be turned off.",
		"# Fritura",
		"- Using the same oil, add the finely chopped onions, a tiny bit of the wine and deglaze using a wooden spatula to scrape the bottom of the pan.",
		"- Add salt, finely chopped garlic, sliced carrots and cook on medium heat for at least 10-12'.",
		"- Pour in the wine, wait until it evaporates completely and turn the heat off. Now move everything to the pot.",
		"# Finishing",
		"- Pour water until the meatballs are almost submerged, add a tsp of paprika, the bay leaf, a dusting of thyme and leave for 45'-1h on low-medium heat, half-covered.",
		"- Correct for salt mid way, and check there is enough sauce or else add water."
    ],
    "variants": [
		"I read once about an Italian grandma who added 1 or 2 seedless raisins to the meatballs' centers. I have done it and it's great. Soak them for a couple minutes in water before, but not too much."
	],
    "tips": {
        "culinary": [],
        "serving": []
    }
}