{
    "name": "Pesto Genovese",
    "category": "Main courses",
    "description": "/'Genoese grounded paste'/ Although the first written recipe dates to 1852, very similar dishes can be found dating back to Roman times, but closer enactments were more prevalent in the Liguria region. Pesto 'alla' Genovese is a clever trick supermarket brands employ to be able to use ingredients that are not in the original, official recipe, like sunflower oil.",
    "origin": "1852 Genoa, Italy. (Emanuele Rossi)",
    "portions": 3,
    "flags": {
        "difficulty": "Very easy",
        "cuisine": "Italian",
        "prepTime": "10'",
        "totalTime": "10'",
        "lactoseFree": false,
        "glutenFree": false,
        "vegetarian": true,
        "vegan": false,
		"finished": true
    },
    "ingredients": {
        "Pesto": [
            "30 g fresh basil leaves (no stems, preferably a green & small variety of basil, i.e. Genoese Basil DOP)",
			"20 g parmigiano reggiano / cured cheese (cow)",
			"10 g pecorino sardo / cured cheese (sheep, from Sardinia)",
			"1 clove of garlic",
            "15 g pine nuts",
            "30 g high quality olive oil",
			"Salt (2 g)"
        ],
		"Pasta": [
			"330 g pasta",
			"Salt"
		]
    },
    "utensils": [
        "Mortar",
        "Airtight container",
        "Fridge"
    ],
    "instructions": [
        "Grind ingredients together until it forms a green paste and save in an airtight container, starting with the basil.",
		"It's alright to use a hand blender too. For the result to be perfect however, grind everything except the oil and garlic at high speed, very finely. Once it's done, repeat with the garlic and oil.",
		"",
		"Boil the pasta, dry out and mix with the pesto."
    ],
    "variants": [
        "Substitute the pine nuts for pistachios or walnuts.",
		"Add lemon juice and/or lemon zest. A small quantity acidifies pesto just enough to make it last much longer. A larger quantity is noticiable, perhaps nicer in summer."
    ],
    "tips": {
        "culinary": [
			"The more slender of a container, the better, as it reduces the area of pesto in contact with the air.",
			"I find that pesto improves slightly the day after. After that it's worse however: it slowly oxidizes and loses color.",
			"Use only basil leaves. The stems would leave annoying fibrous strands.",
			"Add a fine layer of oil to the container to preserve pesto better."
        ],
        "serving": []
    }
}