{
    "name": "Puchero canario",
    "category": "Main courses",
    "description": "/'Canarian earthenware cooked dish'/ Not really cooked on earthenware anymore! It's one of my favourite dishes. This recipe forces you to have a pressure cooker, but you can try just cooking for 3 times longer with a normal pot. You will also have to add the chickpeas and potatoes later or they will crumble to bits.",
    "origin": "1500s, Canary Islands.",
    "portions": 4,
    "flags": {
        "difficulty": "Easy",
        "cuisine": "Canarian",
        "prepTime": "35'",
        "totalTime": "2h",
        "lactoseFree": true,
        "glutenFree": true,
        "vegetarian": false,
        "vegan": false,
		"finished": true
    },
    "ingredients": {
        "Cooking": [
            "400 g beef cut in cubes, clean (whatever has too much fat you can boil separately to get the juice)",
			"240 g chickpeas (either bought dry and put in water 8 h before, or bought canned. Drain the can very well. Both options are good)",
			"200 g cabbage (col, in Spanish)",
			"200 g pumpkin",
			"100 g green beans",
			"4 potatoes",
			"2 carrots",
			"2 tomatoes (ripe)",
			"1 onion",
			"1 cob of corn (can be sweet corn, around 200 g)",
			"An entire head of garlic",
			"Tsp of sweet paprika",
			"Salt"
        ],
		"Serving": [
			"High quality olive oil",
			"Wine vinegar"
		]
    },
    "utensils": [
		"Pressure cooker",
		"Hand blender"
	],
    "instructions": [
        "- Pressure cook the meat with water and a bit of salt for 30'. I separate the fat from the lean parts, and cook the first ones on a separate pot with some water and salt to extract the juice before discarding them.",
		"- Meanwhile, prepare the chickpeas, wash the cabbage (leave it whole), the beans in half, cut the pumpkin in blocks, the potatoes in big chunks, the carrots longitudinally, the tomatoes in two, the onion in two, wash the cob and remove the outer papery skin from the head of garlic.",
		"- Open the pot, put everything in (pumpkin and potatoes last to avoid mashing them), cover with water, add some more salt and a teaspoon of paprika. It shouldn't taste salty by any means, though.",
		"- Take some juice out and blend it with a piece of carrot (to give the potatoes color). Add it back in, seal and leave for 20'.",
		"- I personally now take out the head of garlic, onion and cabbage as they are there for flavor only. Some eat the cabbage.",
		"- You have to fish now the food that you want: Everything but the tomato. Don't worry, it will be used to make <a class='recipeLink' href='sopaPuchero.html'>sopa de puchero</a> the days after."
    ],
    "variants": [],
    "tips": {
        "culinary": [
			"Be careful with the pressure cooker. Always count the time from when the pressure is high (vapor coming out, check valve rises...).",
			"The nutritional information for this recipe is off since we only eat the tomato and a good part of the remains the days after."
		],
        "serving": [
			"The person eating must add oil and vinegar on his own. If it's the first time start small, especially with the vinegar."
		]
    }
}