{
    "name": "Rag첫 alla bolognese",
    "category": "Main courses",
    "description": "/'Bolognese (meat) sauce'/ ",
    "origin": "Late 1800s, Italy.",
    "portions": 8,
    "flags": {
        "difficulty": "Medium",
        "cuisine": "Italian",
        "prepTime": "1h",
        "totalTime": "5h",
        "lactoseFree": false,
        "glutenFree": false,
        "vegetarian": false,
        "vegan": false,
		"finished": true
    },
    "ingredients": {
        "Rag첫": [
            "Tomato passata (big bottle, 700g. Alternatives: use 350g passata, half can or 200g of canned peeled tomatoes and 50g of tomato paste. Cook the paste with the soffrito if so.)",
			"Vegetable stock (keep reading)",
			"2 carrots",
			"1 stalk of celery",
			"1 onion",
			"200g beef (minced. You can substitute part of this for veal)",
			"200g pork (minced)",
			"100g chopped pancetta (pancetta is similar to bacon that is not smoked. Using cured meat is also ok.)",
			"Wine (118 g or 1/2 cup, red or dry white wine)",
			"118 g milk (1/2 of a cup)",
			"Nutmeg (1/3 of a tsp)",
            "Black pepper",
			"Salt",
			"12 g olive oil (1 tbsp)"
        ],
		"Vegetable stock": [
			"1 carrot",
			"1 stalk of celery including leaves",
			"1 onion"
		],
		"Pasta": [
			"880g pasta",
			"Grated cheese (parmesan does well)",
			"Salt"
		]
    },
    "utensils": [
        "Hand blender",
        "Kitchen pot"
    ],
    "instructions": [
        "# Stock",
		"- In a pot pour 1 L of water with a pinch of salt, a carrot, onion and a stalk of celery. Include here too all the leaves from the rag첫's celery.",
		"- Bring up to a simmer and leave for one hour. Only use the liquid afterwards.",
		"# Start cooking the rag첫",
		"- With the olive oil melt the panceta until brown. Set aside but keep the oils in the pot.",
		"- Cook the finely chopped onion until transparent.",
		"- Add the rest of the elements of the soffritto (celery and carrots) finely diced.",
		"- This recipe is tomato heavy, and depending on the season and quality they will add too much acidity. A trick is to, instead of adding sugar, when the soffrito is starting to brown you add half the tomato passata now and cook it well until it starts to caramelize. The oil will sort of separate, you will know when it's ready. Do not burn as always though.",
		"- Add the meat with the pepper and nutmeg, splitting it finely with a wooden spoon until it changes color.",
		"- Pour in the wine, when it fully evaporates add the rest of the tomato sauce, a pinch of salt and the stock. Bring to a low simmer.",
		"# The long cooking process",
		"- Cook covered for 3 hours, no stirring, very low heat.",
		"- Add the milk, check and correct for salt. Cook it uncovered until it reduces to a thick but not dry consistency (about 1 more hour)."
    ],
    "variants": [
        
    ],
    "tips": {
        "culinary": [
			"Making sure the soffritto is well cooked and the wine is completely reduced is very important to ensure the dish stays on the sweet and not too acidic side.",
			"Add olive oil if the residual fat from the meat is not enough. When allowed to cool the meat releases much more fat, which you can also use.",
			"Call your family to clean the pot with some bread. It's tasty and it makes cleaning 20 times easier."
        ],
        "serving": [
		]
    }
}