{
    "name": "Tiramisù",
    "category": "Desserts",
    "description": "/'Pick me up'/ The tiramisù is an Italian dessert that combines dry biscuits soaked in coffee with a mascarpone cheese and egg cream, and a note of bitter cocoa on top. It's one of the world's most famous desserts, and with reason; it's both extremely simple to make and delicious.",
    "origin": "1960-70s Treviso, Italy.",
    "portions": 8,
    "flags": {
        "difficulty": "Easy",
        "cuisine": "Italian",
        "prepTime": "30'",
        "totalTime": "8h 30'",
        "lactoseFree": false,
        "glutenFree": false,
        "vegetarian": true,
        "vegan": false
    },
    "ingredients": {
        "Cream": [
            "75g white sugar",
            "3 egg yolks",
            "250g mascarpone (>40% fat)"
        ],
        "Layering": [
            "Coffee",
            "Bitter cocoa powder",
            "12 Savoiardi (ladyfingers)"
        ]
    },
    "utensils": [
        "Hand mixer",
        "Airtight container",
        "Fridge"
    ],
    "instructions": [
        "Brew coffee and set aside",
        "# Making the cream",
        "- Whip the yolks (whites are excess) with the sugar until it develops soft peaks.",
        "- Incorporate the mascarpone, whip slowly then faster for 3 minutes. Cream shouldn't be pourable, but consistent.",
        "# Layering",
        "- Spread thin layer of cream on the bottom to avoid coffee leaks.",
        "- Dip the ladyfingers once on the coffee, quickly, drain them vertically and place them.",
        "- Add cream until the Savoiardi are hidden, repeat for 3 layers of ladyfingers. With each layer, turn them 90º.",
        "- Finally, add cacao powder on top.",
        "8h rest in the fridge"
    ],
    "variants": [
        "Substitute the Savoiardi for pan di Spagna (bizcocho, Spanish sponge cake)"
    ],
    "tips": {
        "culinary": [
			"Using these quantities, I've tried 4 layers of 4 Savoiardi each, but in my opinion it's better to stay at 3: the cream layers become thicker, and the Tiramisù stays perfectly balanced.",
			"Coffee from an Espresso machine, and even from a well brewed Moka, is too strong. Dilute respectively with x3 and x1 as much water as there is coffee.",
			"Be sure to learn how to brew coffee in a Moka without bitterness for this recipe. It makes a world of difference.",
            "It's a sin to throw away the whites! Conserve them in the fridge. They are high in protein and can be added to scrambled eggs, used for Amaretti biscuits, etc."
        ],
        "serving": [
            "Tiramisù is best served as squares or rectangles."
        ]
    }
}